rainer20512/stm32-fw/common/src/debug_gpio_exti.c
/**
  ******************************************************************************
  * @file    debug_util.c
  * @author  Rainer
  * @brief   functions for debugging/dumping GPIO and EXTI Settings
  *
  ******************************************************************************
  *
  ******************************************************************************
  */

/** @addtogroup DEBUG_UTILS
  * @{
  */

#include "config/config.h"
#include "debug.h"
#include "system/hw_util.h"
#include "dev/devices.h"
#include "dev/hw_device.h"
#if DEBUG_FEATURES > 0

#include <string.h>

#include "hardware.h"
#include "debug_helper.h"
#include "system/exti_handler.h"

/*
 *************************************************************
 * defines
 *************************************************************
 */

/*
 *************************************************************
 * local helper functions 
 *************************************************************
 */


/*
 *************************************************************
 * Functions to dump GPIO status
 *************************************************************
 */


const char * const moder_txt[]={"Inp ", "Out ", "AF  ", "Ana ", "ADC " };
static const char* DBG_get_moder_txt(uint32_t sel, uint16_t ascr )
{
  // If Analog mode and connected to ADC, then annotate accordingly
  if ( sel == 0b11 && ascr ) sel = 4;
  if ( sel < sizeof(moder_txt)/sizeof(char *) ) 
    return moder_txt[sel];
  else
    return "??? ";
}

const char * const pupdr_txt[]={"--  ", "PU  ", "PD  ", "Res " };
static const char* DBG_get_pupdr_txt(uint32_t sel)
{
  if ( sel < sizeof(pupdr_txt)/sizeof(char *) ) 
    return pupdr_txt[sel];
  else
    return "??? ";
}

const char * const ospeedr_txt[]={"Low ", "Med ", "Hi  ", "Vhi " };
static const char* DBG_get_ospeedr_txt(uint32_t sel)
{
  if ( sel < sizeof(ospeedr_txt)/sizeof(char *) ) 
    return ospeedr_txt[sel];
  else
    return "??? ";
}



static void DBG_gpio_dump_moder ( uint32_t moder, uint32_t ascr )
{
  const uint32_t moder_mask = 0xC0000000;
  const uint16_t ascr_mask  = 0x8000;
  uint32_t cnt;
  for ( cnt=0; cnt < 16; cnt++ ) {
    DEBUG_PRINTF("%s",DBG_get_moder_txt((moder & moder_mask) >> 30, ( ascr &  ascr_mask ) >> 15 ));
    moder <<= 2;
    ascr <<= 1;
  }
}

static void DBG_gpio_dump_ospeedr ( uint32_t val )
{
  const uint32_t mask = 0xC0000000;
  uint32_t cnt;
  for ( cnt=0; cnt < 16; cnt++ ) {
    DEBUG_PRINTF("%s",DBG_get_ospeedr_txt((val & mask) >> 30 ));
    val <<= 2;
  }
}

static void DBG_gpio_dump_pupdr ( uint32_t val )
{
  const uint32_t mask = 0xC0000000;
  uint32_t cnt;
  for ( cnt=0; cnt < 16; cnt++ ) {
    DEBUG_PRINTF("%s",DBG_get_pupdr_txt((val & mask) >> 30 ));
    val <<= 2;
  }
}

static void DBG_gpio_dump_afr ( uint32_t val )
{
  const uint32_t mask = 0xF0000000;
  uint32_t cnt;
  uint32_t current;
  for ( cnt=0; cnt  < 8; cnt++ ) {
    current = (val & mask) >> 28;
    print_dec_number ( current, 2, true);DEBUG_PRINTF("  ");
    val <<= 4;
  }
}

static void DBG_gpio_dump_otyper ( uint32_t val )
{
  uint32_t position = 0x8000;
  uint32_t cnt;

  for ( cnt = 0; cnt <16; cnt++ ) {
    DEBUG_PRINTF( position & val ? "OD  " : "PP  " );
    position >>= 1;
  }
}

static void DBG_gpio_dump_bitwise ( uint32_t val )
{
  uint32_t position = 0x8000;
  uint32_t cnt;

  for ( cnt = 0; cnt <16; cnt++ ) {
    DEBUG_PRINTF( position & val ? "1   " : "0   " );
    position >>= 1;
  }
}

static void DBG_gpio_dump_bitnumbers ( char gpio_letter )
{
  int8_t cnt;

  for ( cnt = 15; cnt >= 0; cnt-- ) {
    DEBUG_PUTC ( gpio_letter );
    print_dec_number ( cnt, 2, true);
    DEBUG_PUTC(' ');
  }
}



void DBG_dump_gpio_status(char gpio_letter )
{
    GPIO_TypeDef *gp = HW_GetGPIO ( gpio_letter );
    bool gp_clck_ena; 
    

    DEBUG_PRINTF  ("Status of GPIO%c----------------------------------------------------------\n",gpio_letter);
    if ( !gp ) {
      DEBUG_PUTS  ("  ??? undefined ???");
      return;
    }

    gp_clck_ena = HW_GetHWClockStatus ( gp );
    if ( ! gp_clck_ena ) {
      DEBUG_PUTS  ("  Not clocked ");
      return;
    }

    int oldIndent = DBG_setIndentRel(+2);

    DEBUG_PRINTF("        ");DBG_gpio_dump_bitnumbers(gpio_letter);DEBUG_PUTC('\n');
    DEBUG_PRINTF("MODER  :");DBG_gpio_dump_moder(
                gp->MODER, 
            #if defined(STM32476xx)
                gp->ASCR);
            #else
                0);
            #endif 
    DEBUG_PUTC('\n');
    DEBUG_PRINTF("OTYPER :");DBG_gpio_dump_otyper(gp->OTYPER);DEBUG_PUTC('\n');
    DEBUG_PRINTF("OSPEEDR:");DBG_gpio_dump_ospeedr(gp->OSPEEDR);DEBUG_PUTC('\n');
    DEBUG_PRINTF("OPUPDR :");DBG_gpio_dump_pupdr(gp->PUPDR);DEBUG_PUTC('\n');
    DEBUG_PRINTF("AFR    :");DBG_gpio_dump_afr(gp->AFR[1]);DBG_gpio_dump_afr(gp->AFR[0]);DEBUG_PUTC('\n');
    DEBUG_PRINTF("IDR    :");DBG_gpio_dump_bitwise(gp->IDR);DEBUG_PUTC('\n');
    DEBUG_PRINTF("ODR    :");DBG_gpio_dump_bitwise(gp->ODR);DEBUG_PUTC('\n');
  
    DBG_setIndentAbs(oldIndent);
}

#define TOGGLES 8       /* 8 toggles */
#define DELAY   250     /* duration of every toggle */

void DBG_dump_toggle_pin(char portletter, uint8_t portnum, bool bToggleOnce)
{
    GPIO_TypeDef *gp = HW_GetGPIO ( portletter );
    GPIO_TypeDef save;
    GPIO_InitTypeDef init = {0};
    uint32_t pin_bitmap = 1 << (portnum & 0x0f);
    bool gp_clck_ena; 

    gp_clck_ena = HW_GetHWClockStatus ( gp );
    if ( !gp ) {
        DEBUG_PRINTF("Illegal portletter %c\n", portletter );
        return;
    }

    // Switch portclock on, if not already on
    if (!gp_clck_ena ) HW_SetHWClock(gp, true);

    if (bToggleOnce ) {
        DEBUG_PRINTF("Change %c%02d from %s\n", portletter, portnum, gp->ODR & pin_bitmap ? "H to L": "L to H");
        if (gp->ODR & pin_bitmap)
            gp->BSRR = pin_bitmap<<16;
        else
            gp->BSRR = pin_bitmap;
    } else {
        DEBUG_PRINTF("Toggle %c%02d %d times\n", portletter, portnum, TOGGLES);

        // Save the current GPIO status completely
        save = *gp;

        init.Mode =  GPIO_MODE_OUTPUT_PP;
        init.Pull =  GPIO_NOPULL;
        init.Speed = GPIO_SPEED_FREQ_LOW;
        init.Pin  = pin_bitmap; 
        GpioInitHW(UNREGISTERED_DEVICE, gp, &init);

