rainer20512/stm32-fw/common/src/debug_gpio_exti.c
        for ( uint8_t i = 0; i < TOGGLES; i++ ) {
            gp->ODR  ^= pin_bitmap;
            HAL_Delay(DELAY);
        }

         // restore GPIO status
         *gp = save;
     GpioDeInitHW(UNREGISTERED_DEVICE, gp, pin_bitmap);
     }
     // Switch portclock off again, if it was off before
     if (!gp_clck_ena ) HW_SetHWClock(gp, false);
}

static void DBG_init_pin_internal(uint32_t devIdx, char portletter, uint8_t portnum, bool bDoInit, uint32_t speed, uint32_t pupd_status, uint32_t outval)
{
    GPIO_TypeDef *gp = HW_GetGPIO ( portletter );
    GPIO_InitTypeDef init = {0};
    uint32_t pin_bitmap = 1 << (portnum & 0x0f);
    bool gp_clck_ena; 

    gp_clck_ena = HW_GetHWClockStatus ( gp );
    if ( !gp ) {
        DEBUG_PRINTF("Illegal portletter %c\n", portletter );
        return;
    }

    // Switch portclock on, if not already on
    if (!gp_clck_ena ) HW_SetHWClock(gp, true);

    /* in case of DeInit */
    if ( !bDoInit ) {
        /* in case of DeInit */
        DEBUG_PRINTF("DeInit %c%02d\n", portletter, portnum);
        GpioDeInitHW(devIdx,  gp, pin_bitmap);
    } else {
        DEBUG_PRINTF("Init %c%02d as output\n", portletter, portnum);
        init.Mode =  GPIO_MODE_OUTPUT_PP;
        init.Pin  = pin_bitmap; 
        switch( pupd_status) {
            case 1:
                init.Pull =  GPIO_PULLUP;
                break;
            case 2:
                init.Pull =  GPIO_PULLDOWN;
                break;
            default:
                init.Pull =  GPIO_NOPULL;
        }
        switch(speed) {
            case 1:
                init.Speed = GPIO_SPEED_FREQ_MEDIUM;
                break;
            case 2:
                init.Speed = GPIO_SPEED_FREQ_HIGH;
                break;
            case 3:
                init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                break;
            default:
                init.Speed = GPIO_SPEED_FREQ_LOW;
        }
        switch(outval) {
            case 1:
                /* Set output pin high */
                gp->BSRR = pin_bitmap;
                break;
            default:
                /* Set output pin low */
                gp->BSRR = pin_bitmap<<16;
        }
       GpioInitHW(devIdx,  gp, &init);

    }
    // Switch portclock off again, if it was off before
    if (!gp_clck_ena ) HW_SetHWClock(gp, false);
}

void DBG_init_pin(char portletter, uint8_t portnum, uint32_t speed, uint32_t pupd_status, uint32_t init)
{
    DBG_init_pin_internal(63, portletter, portnum, true, speed, pupd_status, init);
}
void DBG_deinit_pin(char portletter, uint8_t portnum)
{
    DBG_init_pin_internal(63, portletter, portnum, false, 0, 0, 0);
}

/*
 *************************************************************
 * Functions to dump EXTI settings
 *************************************************************
 */
#define EXTI_NAMELEN          12

const char exti_gpio_name[] = "GPIO";

#if defined(STM32L4_FAMILY)
    #if defined(STM32L476xx) || defined(STM32L496xx)
        const char * const exti_line_name[]= { 
        /* insert pattern ( max length is 12 ) 
          "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", */
          "PVD",          "OTG FS wkup",  "RTC alarms",   "RTC tamper  ", "RTC wkup tmr", "COMP1 output", "COMP2 output", "I2C1 wkup",
          "I2C2 wkup",    "I231 wkup",    "USART1 wkup",  "USART2 wkup",  "USART3 wkup",  "UART4 wkup",   "UART5 wkup",   "LPUART1 wkup",
          "LPTIM1   ",    "LPTIM2   ",    "SWPMI1 wkup",  "PVM1 wkup",    "PVM2 wkup",    "PVM3 wkup",    "PVM4 wkup",    "LCD wkup",
          "I2C4 wkup",
        };
    #elif defined(STM32L43xx) 
        const char * const exti_line_name[]= { 
        /* insert pattern ( max length is 12 ) 
          "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", */
          "PVD",          "???",          "RTC alarms",   "RTC tamper  ", "RTC wkup tmr", "COMP1 output", "COMP2 output", "I2C1 wkup",
          "I2C2 wkup",    "I231 wkup",    "USART1 wkup",  "USART2 wkup",  "USART3 wkup",  "??? ",         "???",          "LPUART1 wkup",
          "LPTIM1   ",    "LPTIM2   ",    "SWPMI1 wkup",  "PVM1 wkup",    "???",          "PVM3 wkup",    "PVM4 wkup",    "???",
          "???",
        };
    #elif defined(STM32L4PLUS_FAMILY)
        const char * const exti_line_name[]= { 
        /* insert pattern ( max length is 12 ) 
          "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", */
          "PVD",          "OTG FS wkup",  "RTC alarms",   "RTC tamper  ", "RTC wkup tmr", "COMP1 output", "COMP2 output", "I2C1 wkup",
          "I2C2 wkup",    "I2C3 wkup",    "USART1 wkup",  "USART2 wkup",  "USART3 wkup",  "UART4 wkup",   "UART5 wkup",   "LPUART1 wkup",
          "LPTIM1   ",    "LPTIM2   ",    "Reserved   ",  "PVM1 wkup",    "PVM2 wkup",    "PVM3 wkup",    "PVM4 wkup",    "Reserved",
          "I2C4 wkup",
        };
    #else
        #error "missing EXTI-line names"
    #endif
const char * const exti_domain_name[]= { "EXTI   " };
#define EXTI_MAXNUM             40
#define EXTI_MAXDOMAIN          1
#define EXTI1_IS_GPIO           0b00000000000000001111111111111111
#define EXTI2_IS_GPIO           0b00000000
#define EXTI1_IS_CONFIGURABLE   0b00000000011111011111111111111111
#define EXTI2_IS_CONFIGURABLE   0b01111000
#define EXTI_IS_GPIO(i)         ( i < 16 )
#define EXTI_IS_CFGABLE(i)      ( i > 31 ? EXTI2_IS_CONFIGURABLE : EXTI1_IS_CONFIGURABLE )


#define GET_IMR(d,i)  ( i > 31 ? EXTI->IMR2  : EXTI->IMR1 )
#define GET_EMR(d,i)  ( i > 31 ? EXTI->EMR2  : EXTI->EMR1 )
#define GET_PR(d,i)   ( i > 31 ? EXTI->PR2   : EXTI->PR1 )

#define GET_FTSR(i)   ( i > 31 ? EXTI->FTSR2 : EXTI->FTSR1 )
#define GET_RTSR(i)   ( i > 31 ? EXTI->RTSR2 : EXTI->RTSR1 )

#elif defined(STM32H747xx) || defined(STM32H745xx)
const char * const exti_line_name[]= { 
/* insert pattern ( max length is 12 ) 
  "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", "LPUART1 wkup", */
  "PVD/AVD",      "RTC alarms",   "RTC tamper  ", "RTC wkup tmr", "COMP1 output", "COMP2 output", "I2C1 wkup",    "I2C2 wkup",    
  "I2C3 wkup",    "I2C4 wkup",    "USART1 wkup",  "USART2 wkup",  "USART3 wkup",  "USART3 wkup",  "UART4 wkup",   "UART5 wkup",   
  "UART7 wkup",   "UART8 wkup",   "LPUART1 rx",   "LPUART1 tx",   "SPI1 wkup",    "SPI2 wkup",    "SPI3 wkup",    "SPI4 wkup",
  "SPI7 wkup",    "SPI6 wkup",    "MDIO wkup",    "USB1 wkup",    "USB2 wkup",    "resvd",        "DSI wkup",     "LPTIM1 wkup",    
  "LPTIM2 wkup",  "LPTIM2 outp",  "LPTIM3 wkup",  "LPTIM3 outp",  "LPTIM4 wkup",  "LPTIM5 wkup",  "SWPMI wkup",   "WKUP0 pin", 
  "WKUP1 pin",    "WKUP2 pin",    "WKUP3 pin",    "WKUP4 pin",    "WKUP5 pin",    "RCC Interr.",  "I2C4 Event",   "I2C4 Error",     
  "LPUART1 wkup", "SPI6 Interr.", "BDMA CH0 Int", "BDMA CH1 Int", "BDMA CH2 Int", "BDMA CH3 Int", "BDMA CH4 Int", "BDMA CH5 Int", 
  "BDMA CH6 Int", "BDMA CH7 Int", "DMAMUX2 Int",  "ADC3 Int",     "SAI4 Int",     "HSEM0 Int",    "HSEM1 Int",    "M4 SEV Int",
  "M7 SEV Int",   "resvd",        "WWDG1 reset",  "resvd",        "WWDG2 reset",  "HDMICEC wkup", "ETHER wkup",   "HSECSS wkup",
  "resvd", 
};
