rainer20512/stm32-fw/common/src/debug_gpio_exti.c
#define GET_FTSR(i)  ( i > 31 ? i > 63 ? EXTI->FTSR3 : EXTI->FTSR2 : EXTI->FTSR1 )
#define GET_RTSR(i)  ( i > 31 ? i > 63 ? EXTI->RTSR3 : EXTI->RTSR2 : EXTI->RTSR1 )

#else
    #error "No EXTI Line definitions for current MCU"
    const char * const exti_line_name[]= {};
#endif
/*
 *************************************************************
 * @brief Fill in the EXTI Line name
 * @param sel    - exti line number
 * @param retbuf - return buffer to be written to
 * @param maxlen - length of retbuf on retrun, right padded with blanks
 * @note retbuf must provide at least maxlen+1 bytes !!!
 *************************************************************
 */
static void DBG_get_exti_line_name(uint32_t sel, char *retbuf, const uint32_t maxlen)
{
  uint32_t cptr  = 0;
  const char *p;

  memset(retbuf, ' ', maxlen );
  if ( sel < 16 ) {
    /* assemble constant part plus number ( 2 digits ) */
    cptr = strlen(exti_gpio_name);
    strncpy(retbuf, exti_gpio_name,cptr );
    retbuf[cptr++] = '0' + sel/10;
    retbuf[cptr++] = '0' + sel % 10;
  } else {
    /* Copy namr from array */
    sel -= 16;
    if ( sel < sizeof(exti_line_name)/sizeof(char *) ) {
      p = exti_line_name[sel];
      strncpy(retbuf, p, strlen(p));
    }
  }

  /* append terminating \0 */
  retbuf[maxlen] = '\0';
}


static char DBG_get_exti_pinsource(uint32_t pinidx )
{
  /* one exti config register in SYSCFG->EXTICRx entry is 4 bit wide */
  const uint32_t exticr_mask = 0b1111;
  
  /* One register holds the configuration for four lines */
  uint32_t exticr_offset = pinidx >> 2;

  /* compute the amount of bits to shift mask and shift back result bits */
  uint32_t exticr_shift  = ( pinidx & 0b11 ) * 4;
  
  /* Get the relevant four bits right aligned */
  uint32_t exticr_bits = ( SYSCFG->EXTICR[exticr_offset] & ( exticr_mask << exticr_shift ) ) >> exticr_shift;
  if ( exticr_bits > 8 ) 
    return '?';
  else
    return 'A' + exticr_bits;
}



static void DBG_n_spaces(uint32_t num )
{
  while ( num ) {
    DEBUG_PUTC(' ');
    num--;
  }
}

static void DBG_dump_one_exti(uint32_t domain, uint32_t idx)
{
  char namebuf[EXTI_NAMELEN+1]; 
  uint32_t mask = 1 << ( idx & 0x1f );

  UNUSED(domain);
  DBG_get_exti_line_name(idx, namebuf, EXTI_NAMELEN);
  DEBUG_PRINTF("%s",namebuf);
  if ( ( GET_IMR(domain,idx) | GET_EMR(domain,idx) )  & mask ) {
    DEBUG_PRINTF(" %s %s", GET_IMR(domain,idx) & mask ? "I" : " ", GET_EMR(domain,idx) & mask ? "E" : " ");
    DEBUG_PRINTF(" %s", GET_PR(domain,idx) & mask ? "P" : " ");
    DEBUG_PRINTF(" %s", Exti_Has_Callback(idx) ? "Cb" : "  ");
    if ( mask & EXTI_IS_CFGABLE(idx) ) {
      DEBUG_PRINTF(" %s %s", GET_RTSR(idx) & mask ? "Rise" : "    ", GET_FTSR(idx) & mask ? "Fall" : "    " );
    } else {
        DBG_n_spaces(10);
    }

    if ( EXTI_IS_GPIO(idx) ) {
        DEBUG_PRINTF(" P%c",DBG_get_exti_pinsource(idx));
        print_dec_number ( idx, 2, true);
    } else {
        DBG_n_spaces(5);
    }
  } else {
    DEBUG_PRINTF(" -----"); DBG_n_spaces(18);

  }
}
/******************************************************************************
 * STM32L4xx : Domain  = 0
 * STM32H7xx : Domain  = 0 .. 2 ( D1, D2 and D3 domains )
 *****************************************************************************/
void DBG_dump_exti_config(uint32_t exti_domain)
{
    uint32_t i;
    
    if ( exti_domain >= EXTI_MAXDOMAIN ) return;

    DEBUG_PRINTF("%s Settings ---------------------------------------------------------\n", exti_domain_name[exti_domain]);
    int oldIndent = DBG_setIndentRel(+2);

    for ( i = 0; i <= EXTI_MAXNUM/2; i++ )
    {
      DBG_dump_one_exti(exti_domain,i); DEBUG_PRINTF("  |  " );
      if ( i+EXTI_MAXNUM/2+1 <= EXTI_MAXNUM ) DBG_dump_one_exti(exti_domain, i+EXTI_MAXNUM/2+1); 
      DEBUG_PRINTF("\n" );
    }
 
    DBG_setIndentAbs(oldIndent);

}


/*
 *************************************************************
 * Functions to dump NVIC settings
 *************************************************************
 */

#define NVIC_NAME_LEN             15
const char * const nvic_fmt_undef= "IRQ#%d";
const char * const sys_nvic_name[]= { 
/*.             .             .             .             .             .             .             . */
  "",           "",           "NMI",        "HardFault",  "MemMgmt",    "BusFault",   "UsageFault", "", 
  "",           "",           "",           "SVCall",     "DebugMon",   "",           "PendSV",     "SysTick"
};
#if defined(STM32L43xx)
const char * const user_nvic_name[]= { 
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_CH1",       "DMA1_CH2",       "DMA1_CH3",       "DMA1_CH4",       "DMA1_CH5",
      "DMA1_CH6",       "DMA1_CH7",       "ADC1",           "Resvd.",         "Resvd.",         "Resvd.",         "Resvd.",         "EXTI9_5",  
      "TIM1_BRK/TIM15", "TIM1_UP/TIM16",  "TIM1_TRG/TIM17", "TIM1_CC",        "TIM2",           "Resvd.",         "Resvd.",         "I2C1_EV", 
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "Resvd.",         "Resvd.",         "Resvd.",         "Resvd.",         "Resvd.",         "Resvd.", 
      "Resvd.",         "SDMMC1",         "Resvd.",         "SPI3",           "Resvd.",         "Resvd.",         "TIM6_DACUNDER",  "TIM7", 
      "DMA2_CH1",       "DMA2_CH2",       "DMA2_CH3",       "DMA2_CH4",       "DMA2_CH5",       "Resvd.",         "Resvd.",         "Resvd.",
      "COMP",           "LPTIM1",         "LPTIM2",         "Resvd.",         "DMA2_CH6",       "DMA2_CH7",       "LPUART1",        "QUADSPI", 
      "I2C3_EV",        "I2C3_ER",        "SAI1",           "Resvd.",         "SWPMI1",         "TSC",            "Resvd.",         "Resvd.", 
      "RNG",            "FPU",            "CRS",            "Resvd.",         "Resvd.",         
    };

