rainer20512/stm32-fw/common/src/debug_gpio_exti.c
#elif defined(STM32L476xx) || defined(STM32L496xx)
const char * const user_nvic_name[]= { 
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_CH1",       "DMA1_CH2",       "DMA1_CH3",       "DMA1_CH4",       "DMA1_CH5",
      "DMA1_CH6",       "DMA1_CH7",       "ADC1/ADC2",      "CAN1_TX",        "CAN1_RX0",       "CAN1_RX1",       "CAN1_SCE",       "EXTI9_5",  
      "TIM1_BRK/TIM15", "TIM1_UP/TIM16",  "TIM1_TRG/TIM17", "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV", 
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "DFSDM1_FLT3",    "TIM8_BRK",       "TIM8_UP",        "TIM8_TRG_COM",   "TIM8_CC",        "ADC3", 
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_CH1",       "DMA2_CH2",       "DMA2_CH3",       "DMA2_CH4",       "DMA2_CH5",       "DFSDM1_FLT0",    "DFSDM1_FLT1",    "DFSDM1_FLT2",
      "COMP",           "LPTIM1",         "LPTIM2",         "OTG_FS",         "DMA2_CH6",       "DMA2_CH7",       "LPUART1",        "QUADSPI", 
      "I2C3_EV",        "I2C3_ER",        "SAI1",           "SAI2",           "SWPMI1",         "TSC",            "LCD",            "AES", 
      "RNG",            "FPU",            "HASH/CRS",       "I2C4_EV",        "I2C4_ER",        "DCMI",           "CAN2_TX",        "CAN2_RX0", 
      "CAN1_RX1",       "CAN1_SCE",       "DMA2D",
    };

#elif defined(STM32L4Pxxx) || defined(STM32L4Qxxx)
const char * const user_nvic_name[]= { 
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_CH1",       "DMA1_CH2",       "DMA1_CH3",       "DMA1_CH4",       "DMA1_CH5",
      "DMA1_CH6",       "DMA1_CH7",       "ADC1/ADC2",      "CAN1_TX",        "CAN1_RX0",       "CAN1_RX1",       "CAN1_SCE",       "EXTI9_5",  
      "TIM1_BRK/TIM15", "TIM1_UP/TIM16",  "TIM1_TRG/TIM17", "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV", 
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm/SSRU", "Reserved",       "TIM8_BRK",       "TIM8_UP",        "TIM8_TRG_COM",   "TIM8_CC",        "SDMMC2", 
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_CH1",       "DMA2_CH2",       "DMA2_CH3",       "DMA2_CH4",       "DMA2_CH5",       "DFSDM1_FLT0",    "DFSDM1_FLT1",    "Reserved",
      "COMP",           "LPTIM1",         "LPTIM2",         "OTG_FS",         "DMA2_CH6",       "DMA2_CH7",       "LPUART1",        "OCTOSPI1", 
      "I2C3_EV",        "I2C3_ER",        "SAI1",           "SAI2",           "OCTOSPI2",       "TSC",            "Reserved",        "AES", 
      "RNG",            "FPU",            "HASH/CRS",       "I2C4_ER",        "I2C4_EV",        "DCMI_PSSI",      "PKA",             "Reserved", 
      "Reserved",       "Reserved",       "DMA2D",          "LCD-TFT",        "LCD-TFT_ER",     "Reserved",       "DMAMUX_OVR", 
    };


#elif defined(STM32L4Rxxx) || defined(STM32L4Sxxx)
const char * const user_nvic_name[]= { 
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_CH1",       "DMA1_CH2",       "DMA1_CH3",       "DMA1_CH4",       "DMA1_CH5",
      "DMA1_CH6",       "DMA1_CH7",       "ADC1/ADC2",      "CAN1_TX",        "CAN1_RX0",       "CAN1_RX1",       "CAN1_SCE",       "EXTI9_5",  
      "TIM1_BRK/TIM15", "TIM1_UP/TIM16",  "TIM1_TRG/TIM17", "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV", 
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "DFSDM1_FLT3",    "TIM8_BRK",       "TIM8_UP",        "TIM8_TRG_COM",   "TIM8_CC",        "Reserved", 
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_CH1",       "DMA2_CH2",       "DMA2_CH3",       "DMA2_CH4",       "DMA2_CH5",       "DFSDM1_FLT0",    "DFSDM1_FLT1",    "DFSDM1_FLT2",
      "COMP",           "LPTIM1",         "LPTIM2",         "OTG_FS",         "DMA2_CH6",       "DMA2_CH7",       "LPUART1",        "OCTOSPI1", 
      "I2C3_EV",        "I2C3_ER",        "SAI1",           "SAI2",           "OCTOSPI2",       "TSC",            "DSIHOST",        "AES", 
      "RNG",            "FPU",            "HASH/CRS",       "I2C4_EV",        "I2C4_ER",        "DCMI",           "Reserved",       "Reserved", 
      "Reserved",       "Reserved",       "DMA2D",          "LCD-TFT",        "LCD-TFT_ER",     "GFXMMU",         "DMAMUX_OVR", 
    };

#elif defined(STM32H747xx) || defined(STM32H745xx)
const char * const user_nvic_name[150]= { /* fill in the array size to be sure, all names have been hacken in */
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_St#0",      "DMA1_St#1",      "DMA1_St#2",      "DMA1_St#3",      "DMA1_St#4",
      "DMA1_St#5",      "DMA1_St#6",      "ADC1/ADC2",      "FDCAN1_IT0",     "FDCAN2_IT0",     "FDCAN1_IT1",     "FDCAN2_IT1",     "EXTI9_5",
      "TIM1_BRK",       "TIM1_UP",        "TIM1_TRG",       "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV",
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "resvd",          "TIM8_BRK/TIM12", "TIM8_UP/TIM13",  "TIM8_TRG/TIM14", "TIM8_CC",        "DMA1_St#7",
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_St#0",      "DMA2_St#1",      "DMA2_St#2",      "DMA2_St#3",      "DMA2_St#4",      "ETH",            "ETH_WKUP",       "FDCAN_CAL",
      "M7_SEV",         "M4_SEV",         "n/c",            "n/c",            "DMA2_St#5",      "DMA2_St#6",      "DMA2_St#7",       "USART6",
      "I2C3_EV",        "I2C3_ER",        "USB1_HS_OUT",    "USB1_HS_IN",     "USB1_HS_WKUP",   "USB1_HS",        "DCMI",           "CRYP",
      "HASH_RNG",       "FPU",            "UART7",          "UART8",          "SPI4",           "SPI5",           "SPI6",           "SAI1",
      "LTDC",           "LTDC_ER",        "DMA2D",          "SAI2",           "QUADSPI",        "LPTIM1",         "CEC",            "I2C4_EV",
      "I2C4_ER",        "SPDIF",          "USB2_FS_OUT",    "USB2_FS_IN",     "USB2_FS_WKUP",   "USB2_FS",        "DMAMUX1_OV",     "HRTIM1_MST",
      "HRTIM1_TIMA",    "HRTIM1_TIMB",    "HRTIM1_TIMC",    "HRTIM1_TIMD",    "HRTIM1_TIME",    "HRTIM1_FAULT",   "DFSDM1_FILT0",   "DFSDM1_FILT1",   
      "DFSDM1_FILT2",   "DFSDM1_FILT3",   "SAI3",           "SWPMI1",         "TIM15",          "TIM16",          "TIM17",          "MDIOS_WKUP",
      "MDIOS",          "JPEG",           "MDMA",           "DSI(WKUP)",      "SDMMC2",         "HSEM0",          "HSEM1",          "ADC3",
      "DMAMUX_OVR",     "BDMA_Ch#0",      "BDMA_Ch#1",      "BDMA_Ch#2",      "BDMA_Ch#3",      "BDMA_Ch#4",      "BDMA_Ch#5",      "BDMA_Ch#6",       
      "BDMA_Ch#7",      "COMP",           "LPTIM2",         "LPTIM3",         "LPTIM4",         "LPTIM5",         "LPUART",         "WWDG_RST",       
      "CRS",            "ECC",            "SAI4",           "HOLD_CORE",      "WKUP",
    };
#elif defined(STM32H723xx) || defined(STM32H733xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H730xx)
const char * const user_nvic_name[170]= { /* fill in the array size to be sure, all names have been hacked in */
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_St#0",      "DMA1_St#1",      "DMA1_St#2",      "DMA1_St#3",      "DMA1_St#4",
      "DMA1_St#5",      "DMA1_St#6",      "ADC1/ADC2",      "FDCAN1_IT0",     "FDCAN2_IT0",     "FDCAN1_IT1",     "FDCAN2_IT1",     "EXTI9_5",
      "TIM1_BRK",       "TIM1_UP",        "TIM1_TRG",       "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV",
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "resvd",          "TIM8_BRK/TIM12", "TIM8_UP/TIM13",  "TIM8_TRG/TIM14", "TIM8_CC",        "DMA1_St#7",
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_St#0",      "DMA2_St#1",      "DMA2_St#2",      "DMA2_St#3",      "DMA2_St#4",      "ETH",            "ETH_WKUP",       "FDCAN_CAL",
      "n/c",            "n/c",            "n/c",            "n/c",            "DMA2_St#5",      "DMA2_St#6",      "DMA2_St#7",      "USART6",
      "I2C3_EV",        "I2C3_ER",        "USB1_HS_OUT",    "USB1_HS_IN",     "USB1_HS_WKUP",   "USB1_HS",        "DCMI",           "CRYP",
      "HASH_RNG",       "FPU",            "UART7",          "UART8",          "SPI4",           "SPI5",           "SPI6",           "SAI1",
      "LTDC",           "LTDC_ER",        "DMA2D",          "n/c",            "OCTOSPI1",       "LPTIM1",         "CEC",            "I2C4_EV",
      "I2C4_ER",        "SPDIF",          "n/c",            "n/c",            "n/c",            "n/c",            "DMAMUX1_OVR",    "n/c",
      "n/c",            "n/c",            "n/c",            "n/c",            "n/c",            "n/c",            "DFSDM1_FILT0",   "DFSDM1_FILT1",   
      "DFSDM1_FILT2",   "DFSDM1_FILT3",   "n/c",            "SWPMI1",         "TIM15",          "TIM16",          "TIM17",          "MDIOS_WKUP",
      "MDIOS",          "n/c",            "MDMA",           "n/c",            "SDMMC2",         "HSEM0",          "n/c",            "ADC3",
      "DMAMUX2_OVR",    "BDMA_Ch#0",      "BDMA_Ch#1",      "BDMA_Ch#2",      "BDMA_Ch#3",      "BDMA_Ch#4",      "BDMA_Ch#5",      "BDMA_Ch#6",       
      "BDMA_Ch#7",      "COMP",           "LPTIM2",         "LPTIM3",         "LPTIM4",         "LPTIM5",         "LPUART",         "n/c",       
      "CRS",            "RAMECC",         "SAI4",           "TEMP_IT",        "n/c",            "WKUP",           "OCTOSPI2",       "OTFDEC1",
      "OTFDEC2",        "FMAC",           "CORDIC",         "UART9",          "USART10",        "I2C5_EV",        "I2C5_ER",        "FDCAN3_IT0",     
      "FDCAN3_IT1",     "TIM23",          "TIM24",
    };
#elif defined(STM32H742xx) || defined(STM32H743xx)
const char * const user_nvic_name[150]= { /* fill in the array size to be sure, all names have been hacken in */
    /*.                 .                 .                 .                 .                 .                 .                 . */
      "WWDG",           "PVD/PVM",        "RTC tamper",     "RTC wkup",       "Flash",          "RCC",            "EXTI0",          "EXTI1", 
      "EXTI2",          "EXTI3",          "EXTI4",          "DMA1_St#0",      "DMA1_St#1",      "DMA1_St#2",      "DMA1_St#3",      "DMA1_St#4",
      "DMA1_St#5",      "DMA1_St#6",      "ADC1/ADC2",      "FDCAN1_IT0",     "FDCAN2_IT0",     "FDCAN1_IT1",     "FDCAN2_IT1",     "EXTI9_5",
      "TIM1_BRK",       "TIM1_UP",        "TIM1_TRG",       "TIM1_CC",        "TIM2",           "TIM3",           "TIM4",           "I2C1_EV",
      "I2C1_ER",        "I2C2_EV",        "I2C2_ER",        "SPI1",           "SPI2",           "USART1",         "USART2",         "USART3", 
      "EXTI15_10",      "RTC alarm",      "resvd",          "TIM8_BRK/TIM12", "TIM8_UP/TIM13",  "TIM8_TRG/TIM14", "TIM8_CC",        "DMA1_St#7",
      "FMC",            "SDMMC1",         "TIM5",           "SPI3",           "UART4",          "UART5",          "TIM6_DACUNDER",  "TIM7", 
      "DMA2_St#0",      "DMA2_St#1",      "DMA2_St#2",      "DMA2_St#3",      "DMA2_St#4",      "ETH",            "ETH_WKUP",       "FDCAN_CAL",
      "M7_SEV",         "n/c",            "n/c",            "n/c",            "DMA2_St#5",      "DMA2_St#6",      "DMA2_St#7",      "USART6",
      "I2C3_EV",        "I2C3_ER",        "USB1_HS_OUT",    "USB1_HS_IN",     "USB1_HS_WKUP",   "USB1_HS",        "DCMI",           "CRYP",
      "HASH_RNG",       "FPU",            "UART7",          "UART8",          "SPI4",           "SPI5",           "SPI6",           "SAI1",
      "LTDC",           "LTDC_ER",        "DMA2D",          "SAI2",           "QUADSPI",        "LPTIM1",         "CEC",            "I2C4_EV",
      "I2C4_ER",        "SPDIF",          "USB2_FS_OUT",    "USB2_FS_IN",     "USB2_FS_WKUP",   "USB2_FS",        "DMAMUX1_OV",     "HRTIM1_MST",
      "HRTIM1_TIMA",    "HRTIM1_TIMB",    "HRTIM1_TIMC",    "HRTIM1_TIMD",    "HRTIM1_TIME",    "HRTIM1_FAULT",   "DFSDM1_FILT0",   "DFSDM1_FILT1",   
      "DFSDM1_FILT2",   "DFSDM1_FILT3",   "SAI3",           "SWPMI1",         "TIM15",          "TIM16",          "TIM17",          "MDIOS_WKUP",
      "MDIOS",          "JPEG",           "MDMA",           "n/c",            "SDMMC2",         "HSEM0",          "n/c",            "ADC3",
      "DMAMUX_OVR",     "BDMA_Ch#0",      "BDMA_Ch#1",      "BDMA_Ch#2",      "BDMA_Ch#3",      "BDMA_Ch#4",      "BDMA_Ch#5",      "BDMA_Ch#6",       
      "BDMA_Ch#7",      "COMP",           "LPTIM2",         "LPTIM3",         "LPTIM4",         "LPTIM5",         "LPUART",         "WWDG_RST",       
      "CRS",            "RAMECC",         "SAI4",           "n/c",            "n/c",            "WKUP"
    };
#else
    #error "No NVIC Line definitions for current MCU"
    const char * const exti_line_name[]= {};
#endif
/*
 *************************************************************
 * @brief Fill in the EXTI Line name
 * @param sel    - exti line number
 * @param retbuf - return buffer to be written to
 * @param maxlen - length of retbuf on retrun, right padded with blanks
 * @note retbuf must provide at least maxlen+1 bytes !!!
 *************************************************************
 */
static void DBG_get_nvic_irq_name(int32_t irqnum, char *retbuf, const uint32_t maxlen)
{
  const char *p;

