rainer20512/stm32-fw/common/src/debug_gpio_exti.c
  memset(retbuf, ' ', maxlen );
  if ( irqnum < 0 ) {
    p = sys_nvic_name[16+irqnum];
    /* Copy Name to return buffer */
    strncpy(retbuf, p, strlen(p) );
  } else {
      if ( irqnum < (int32_t)(sizeof(user_nvic_name)/sizeof(char *)) ) {
        p = user_nvic_name[irqnum];
        /* Copy Name to return buffer */
        strncpy(retbuf, p, strlen(p) );
      } else {
        /* write directly to return buffer */
        snprintf(retbuf, maxlen, nvic_fmt_undef, irqnum); 
        /* and overwrite the terminating \0 with blank to adjust length of string */
        retbuf[strlen(retbuf)] = ' ' ;
      }
  }
  /* append terminating \0 in any case */
  retbuf[maxlen] = '\0';
}

static uint32_t NVIC_Is_IRQ_enabled(IRQn_Type IRQn)
{
  return((uint32_t)(((NVIC->ISER[(((uint32_t)(int32_t)IRQn) >> 5UL)] & (1UL << (((uint32_t)(int32_t)IRQn) & 0x1FUL))) != 0UL) ? 1UL : 0UL));
}



static void DBG_dump_one_nvic_entry(int32_t irqnum, uint32_t prigroup)
{
  char namebuf[NVIC_NAME_LEN+1];
  uint32_t uPreemptPriority, uSubPriority;
  char enabled;

  enabled = ( irqnum < 0 ? 'E' : ( NVIC_Is_IRQ_enabled((IRQn_Type)irqnum) ? 'E' : '-' ) );

  DBG_get_nvic_irq_name( irqnum, namebuf, NVIC_NAME_LEN);
  HAL_NVIC_GetPriority((IRQn_Type) irqnum, prigroup, &uPreemptPriority, &uSubPriority);
  DBG_printf_indent("%s %c %2d %2d", namebuf, enabled, uPreemptPriority, uSubPriority );
}

void DBG_dump_prio_gouping(uint32_t prigroup )
{
  uint32_t pri,subpri;
  pri=subpri=0;
  
  switch(prigroup ) {
    case 0:
    case 1:
    case 2:
    case 3:
      pri    = 16;
      break;
    case 4:
      pri    = 8;
      subpri = 2;
      break;
    case 5:
      pri    = 4;
      subpri = 4;
      break;
    case 6:
      pri    = 2;
      subpri = 8;
      break;
    case 7:
      subpri = 16;
      break;
  }
  DBG_printf_indent("Prigroup=%d, i.e. %d group priority levels and %d subpriority levels\n", prigroup, pri, subpri );
}  

void DBG_dump_nvic_config(void)
{ 
    int oldIndent, prigroup, max_ints;
    prigroup = NVIC_GetPriorityGrouping();
    max_ints = (( SCnSCB->ICTR & SCnSCB_ICTR_INTLINESNUM_Msk ) << SCnSCB_ICTR_INTLINESNUM_Pos ) * 32 + 32;


    DEBUG_PUTS  ("NVIC Settings -------------------------------------------------------------" );
    oldIndent = DBG_setIndentRel(+2);
    DBG_dump_prio_gouping( prigroup );
    DBG_dump_number("Max Nr of Interrupts :", max_ints );
    
    DEBUG_PUTS  ("CortexM Interrupts ------------------------------------------------------" );
    DBG_setIndentRel(+2);
    DBG_dump_one_nvic_entry(NonMaskableInt_IRQn, prigroup );                /*! Cortex-M4 Non Maskable Interrupt         */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(HardFault_IRQn, prigroup);                      /*! Cortex-M4 Hard Fault Interrupt           */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(MemoryManagement_IRQn, prigroup);               /*! Cortex-M4 Memory Management Interrupt    */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(BusFault_IRQn, prigroup);                       /*! Cortex-M4 Bus Fault Interrupt            */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(UsageFault_IRQn, prigroup);                     /*! Cortex-M4 Usage Fault Interrupt          */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(SVCall_IRQn, prigroup);                         /*! Cortex-M4 SV Call Interrupt              */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(DebugMonitor_IRQn, prigroup);                   /*! Cortex-M4 Debug Monitor Interrupt        */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(PendSV_IRQn, prigroup);                         /*! Cortex-M4 Pend SV Interrupt              */
    DEBUG_PUTC('\n');
    DBG_dump_one_nvic_entry(SysTick_IRQn, prigroup);                        /*! Cortex-M4 System Tick Interrupt          */
    DEBUG_PUTC('\n');
    DBG_setIndentRel(-2);

    DEBUG_PUTS  ("Configurable Interrupts -------------------------------------------------" );
    DBG_setIndentRel(+2);
    for ( uint32_t i = 0; i <= (uint32_t)max_ints ; i++ ) {
      if ( NVIC_Is_IRQ_enabled((IRQn_Type) i ) ) {
        DBG_dump_one_nvic_entry(i, prigroup); 
        DEBUG_PUTC('\n');
      }
    }
    oldIndent = DBG_setIndentRel(+2);
 
    /* keks */

 
    DBG_setIndentAbs(oldIndent);
}


#endif // #if DEBUG_FEATURES > 0

/**
  * @}
  */
